In [163]:
import pandas as pd
import numpy as np
import sqlite3 as sqlite
import sqlalchemy

In [164]:
df = pd.read_excel("test.xlsx", sheet_name=0)

In [165]:
df.rename({"Unnamed: 0": "Test"}, axis=1, inplace=True)
df.drop(columns=['Test'], inplace=True)

In [166]:
#This loop replaced all First Names that starts with M or K with "Replaced"

for i in range(len(df.index)):
    if df['First Name'][i][0] == 'M' or df['First Name'][i][0] == "K":
        df['First Name'][i] = "Replaced"

C:\Users\putte\AppData\Local\Temp\ipykernel_11140\504291191.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['First Name'][i] = "Replaced"

In [171]:
male_df = df[(df['Gender'] == "Male")]

male_df

     First Name  Last Name Gender        Country  Age        Date    Id
2        Philip       Gent   Male         France   36  21/05/2015  2587
5        Gaston      Brumm   Male  United States   24  21/05/2015  2554
11     Franklyn     Unknow   Male         France   38  15/10/2017  2579
13     Replaced  Zabriskie   Male  Great Britain   26  21/05/2015  2587
24       Lester    Prothro   Male         France   21  15/10/2017  6574
...         ...        ...    ...            ...  ...         ...   ...
4989      Chase     Karner   Male  United States   37  15/10/2017  2154
4990     Tommie  Underdahl   Male  United States   26  16/08/2016  3265
4992      Angel      Sanor   Male         France   24  15/10/2017  3259
4994     Weston    Martina   Male  United States   26  21/05/2015  6540
4998     Jeromy       Danz   Male  United States   39  15/10/2017  3265

[1200 rows x 7 columns]